Revit 2022 API
GeometryInstance Methods
The GeometryInstance type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetInstanceGeometry()
Computes the geometric representation of the instance.
GetInstanceGeometry(Transform)
Computes a transformation of the geometric representation of the instance.
GetSymbolGeometry()
Computes the geometric representation of the symbol which generates this instance.
GetSymbolGeometry(Transform)
Computes a transformation of the geometric representation of the symbol which generates this instance.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
GeometryInstance Class
Autodesk.Revit.DB Namespace